In [2]:
import pandas as pd
import numpy as np

In [5]:
list_of_list = [['Jaggy',50000], ['Maggy', 25000], ['Jaguar', 40000], ['Maguire', 30000], ['J-zay', 1000000], ['Halie', 60000]] 
column = ['Name', 'Income']
df = pd.DataFrame(list_of_list, columns=column)
df.head(6)

      Name   Income
0    Jaggy    50000
1    Maggy    25000
2   Jaguar    40000
3  Maguire    30000
4    J-zay  1000000
5    Halie    60000

In the above dataframe index 5 is a outlier.

An outlier is a data point that differs significantly from other observations. In the above dataframe 1000000 income has signigicantly different from others income.

In [6]:
# basic statitics of the dataframe
df.describe()

               Income
count        6.000000
mean    200833.333333
std     391719.499983
min      25000.000000
25%      32500.000000
50%      45000.000000
75%      57500.000000
max    1000000.000000

describe() gives you the basics statistics of the dataframe such as count, mean, standard deviatin,  minimum income, maximum income, first quartile, second quartile and so on

In [8]:
# Let's find out the 3rd qurtile from the dataframe
df.Income.quantile(0.75)

57500.0

In [12]:
# you can find your desired quartile 
df.Income.quantile(0.55, interpolation='lower') # interpolation gives you the higher and lower of 2 income of your quartile

40000

In [14]:
# Lets try and handle outlier

percentile_99 = df.Income.quantile(0.99)
percentile_99

953000.0000000001

In [15]:
df_no_outlier = df[df.Income < percentile_99]
df_no_outlier

      Name  Income
0    Jaggy   50000
1    Maggy   25000
2   Jaguar   40000
3  Maguire   30000
5    Halie   60000

In [16]:
# Now Let's work on missing value

df['Income'][3] = np.NaN

/tmp/ipykernel_7425/1920993777.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Income'][3] = np.NaN
/tmp/ipykernel_7425/1920993777.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income'][3] = np.NaN

In [17]:
df

      Name     Income
0    Jaggy    50000.0
1    Maggy    25000.0
2   Jaguar    40000.0
3  Maguire        NaN
4    J-zay  1000000.0
5    Halie    60000.0

Now you can see Maguire has no income

lets fill maguire income with right guess

In [18]:
# Averave of income is
df['Income'].mean()

235000.0

The average is very high because of an outlier

In this type of case we use median instead

In [23]:
df['Income'].median() # output is 50000
# lets fill the value using median
fill_df = df.fillna(df['Income'].median())
fill_df

      Name     Income
0    Jaggy    50000.0
1    Maggy    25000.0
2   Jaguar    40000.0
3  Maguire    50000.0
4    J-zay  1000000.0
5    Halie    60000.0